[
  {
    "title": "Bitget Launches Isolated Spot Margin Trading for S/USDT",
    "link": "https://chainwire.org/2025/02/25/bitget-launches-isolated-spot-margin-trading-for-s-usdt/",
    "pubDate": "2025-02-25T12:00:06.000Z",
    "content": "<p><span><strong>Victoria, Seychelles, February 25th, 2025, Chainwire</strong></span></p>\n<p></p>\n<p><a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://www.bitget.com/\">Bitget</a>, the leading cryptocurrency exchange and Web3 company has introduced isolated spot margin trading for S/USDT, expanding its suite of trading services to enhance user experience and provide more strategic trading opportunities.</p>\n<p>To mark the listing of new coins, Bitget is offering exclusive perks to traders. Users will receive spot leverage cut-rate coupons or trading bonuses credited to their accounts at random. These coupons enable traders to access leverage at reduced or zero interest rates, while the trading bonuses can be directly utilized in margin trading. Eligible users can claim these benefits through the Coupons Center on the Bitget platform.</p>\n<p>Isolated spot margin trading offers traders greater flexibility and risk management by allowing them to allocate margin independently for each trading pair. This ensures that potential losses in one position do not affect other holdings, providing enhanced security and control over trading strategies. The introduction of this feature underscores Bitget’s ongoing efforts to optimize trading conditions and improve market efficiency.</p>\n<p>For more information on spot margin trading for S/USDT, visit <a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://www.bitget.com/support/articles/12560603823129\">here</a>.</p>\n<p><strong>About Bitget</strong></p>\n<p>Established in 2018, <a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://www.bitget.com/\">Bitget</a> is the world&#8217;s leading <a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://www.bitget.com/\">cryptocurrency exchange</a> and Web3 company. Serving over 100 million users in 150+ countries and regions, the Bitget exchange is committed to helping users trade smarter with its pioneering copy trading feature and other trading solutions while offering real-time access to <a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://www.bitget.com/price/bitcoin\">Bitcoin price</a>,<a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://www.bitget.com/price/ethereum\"> Ethereum price</a>, and other cryptocurrency prices. Formerly known as BitKeep, <a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://web3.bitget.com/en\">Bitget Wallet</a> is a world-class multi-chain crypto wallet that offers an array of comprehensive Web3 solutions and features including wallet functionality, token swap, NFT Marketplace, DApp browser, and more.</p>\n<p>Bitget is at the forefront of driving crypto adoption through strategic partnerships, such as its role as the Official Crypto Partner of the World&#8217;s Top Football League, <strong>LALIGA</strong>, in EASTERN, SEA, and LATAM markets, as well as a global partner of Turkish National athletes <strong>Buse Tosun Çavuşoğlu </strong>(Wrestling world champion), <strong>Samet Gümüş</strong> (Boxing gold medalist) and<strong> İlkin Aydın</strong> (Volleyball national team), to inspire the global community to embrace the future of cryptocurrency.</p>\n<p>For more information, visit: <a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://www.bitget.com/en/\">Website</a> | <a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://twitter.com/bitgetglobal\">Twitter</a> | <a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://t.me/BitgetENOfficial\">Telegram</a> | <a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://www.linkedin.com/company/bitget-global/\">LinkedIn</a> | <a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://discord.com/invite/bitget\">Discord</a> | <a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://web3.bitget.com/en\">Bitget Wallet</a></p>\n<p>For media inquiries, please contact: media@bitget.com</p>\n<p><strong>Risk Warning: </strong>Digital asset prices are subject to fluctuation and may experience significant volatility. Investors are advised to only allocate funds they can afford to lose. The value of any investment may be impacted, and there is a possibility that financial objectives may not be met, nor the principal investment recovered. Independent financial advice should always be sought, and personal financial experience and standing carefully considered. Past performance is not a reliable indicator of future results. Bitget accepts no liability for any potential losses incurred. Nothing contained herein should be construed as financial advice. For further information, please refer to our <a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://www.bitget.com/support/articles/360014944032-terms-of-use\">Terms of Use</a>.</p>\n<p></p>\n<h5>Contact</h5>\n<p><span><strong>Media</strong><br /></span><span><strong>Public Relations</strong><br /></span><span><strong>Bitget</strong><br /></span><span><strong>media@bitget.com</strong><br /></span></p>\n<p>The post <a href=\"https://chainwire.org/2025/02/25/bitget-launches-isolated-spot-margin-trading-for-s-usdt/\">Bitget Launches Isolated Spot Margin Trading for S/USDT</a> appeared first on <a href=\"https://chainwire.org\">Chainwire</a>.</p>\n"
  },
  {
    "title": "DTX Exchange Sets Final Token Price at $0.36 as Presale Concludes",
    "link": "https://chainwire.org/2025/02/25/dtx-exchange-sets-final-token-price-at-0-36-as-presale-concludes/",
    "pubDate": "2025-02-25T11:45:42.000Z",
    "content": "<p><span><strong>London, United Kingdom, February 25th, 2025, Chainwire</strong></span></p>\n<p></p>\n<p><a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://dtx.exchange/\">DTX Exchange</a>, a leading asset trading platform, has confirmed its final presale token price at $0.36 as it enters the closing phase of its token sale.</p>\n<p>DTX Exchange has raised over $15.1 million during its ongoing presale. As a hybrid trading platform, it has attracted attention within the digital asset sector. With a community of over 600,000 members, the platform is preparing for its next phase, which includes expanded market accessibility and liquidity.</p>\n<p>The platform has confirmed its final presale token price at $0.36 in the bonus round. This development follows months of platform growth, community participation, and technological advancements. DTX Exchange aims to provide a multi-asset trading environment, offering access to crypto, forex, ETFs, and stock trading.</p>\n<p><strong>First Hybrid Blockchain Platform Backed By DeFi Features </strong></p>\n<p>DTX Exchange is the first crypto-native trading platform designed to bridge the gap between traditional finance and decentralized trading. The hybrid exchange consolidates over 120,000 asset types under a single umbrella and offers unprecedented flexibility to traders. </p>\n<p><strong>Key Features of DTX Exchange </strong></p>\n<ul>\n<li><strong>Multi-Asset Trading &#8211; </strong>Users can trade crypto, forex, tokenized stocks, and ETFs on a single secure platform. </li>\n<li><strong>Trading Leverage</strong> – Includes leverage options on select trading pairs.</li>\n<li><strong>Phoenix Wallet</strong> &#8211; Decentralized asset custody solution designed with institutional-grade security and native platform integration. </li>\n<li><strong>Tokenized ETFs</strong> &#8211; Industry-first platform to offer tokenized ETF trading for global users from 80+ regions. </li>\n</ul>\n<p><strong>Historic Adoption and Ecosystem Growth </strong></p>\n<p>With over $15.1 million raised during the presale round, DTX Exchange is backed by a community of over 600,000 traders. The growth rate of the platform during its initial phase has made history. In less than 100 days after launch, the platform has successfully sold over 10 rounds and is currently in the final round of the presale. </p>\n<p>Additionally, listings on data tracking platforms <a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://coinmarketcap.com/currencies/dtx-exchange\">CoinMarketCap</a> and CoinGecko are already live. Further details regarding availability on centralized exchanges are expected to be announced in the coming weeks.</p>\n<p><strong>DTX Listing Price Updated to $0.36 </strong></p>\n<p>The DTX Exchange team has set the final presale token price at $ 0.36 for the final listing. This represents a 200% increase from the current price of $0.18 in the bonus round. </p>\n<p>DTX Exchange has a fixed total supply of 475,000,000 tokens. The token distribution includes 50% for presale, 23% for ecosystem development, 20% for liquidity and listings, 10% for the team, 5% for advisors, and 2% for the airdrop. Further details about CEX listings are expected to be announced in the coming weeks. Investors who are interested in DTX can currently participate in the public presale. </p>\n<p><strong>Exploring DTX </strong></p>\n<p><a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://dtx.exchange/\">The DTX</a> team remains committed to continuous innovation and strategic expansion, with upcoming developments expected to push the platform to new heights. With mass adoption incoming, this is the final opportunity for investors to join the groundbreaking project before its official launch. </p>\n<p><strong>About DTX Exchange</strong></p>\n<p><a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://dtxexchange.com?utm_source=chainwire&amp;utm_medium=muneeb&amp;utm_campaign=53\">DTX Exchange</a> is the first hybrid trading platform with its VulcanX blockchain infrastructure. The platform is redefining the global trading industry with its cross-functional approach towards stocks, crypto assets, equities, and contract trading options. With support from a rapidly growing community, DTX Exchange aims to make an impact. For more information about the upcoming features and developments, users can visit the DTX Exchange website or interact with the community on Telegram. </p>\n<p>Users can visit the links below for further details about DTX Exchange (DTX):</p>\n<p><strong>Website: </strong><a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://dtxexchange.com\"><strong>https://dtxexchange.com</strong></a></p>\n<p><strong>Whitepaper: </strong><a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://dtx.exchange/whitepaper.pdf\"><strong>https://dtx.exchange/whitepaper.pdf</strong></a><strong> </strong></p>\n<p><strong>Twitter: </strong><a target=\"_blank\" rel=\"nofollow noopener\" href=\"http://www.twitter.com/dtxexchange\"><strong>www.twitter.com/dtxexchange</strong></a></p>\n<p><strong>Telegram: </strong><a target=\"_blank\" rel=\"nofollow noopener\" href=\"http://www.t.me/dtxexchange\"><strong>www.t.me/dtxexchange</strong></a><strong> </strong></p>\n<p></p>\n<h5>Contact</h5>\n<p><span><strong>DTX Exchange</strong><br /></span><span><strong>DTX Innovations</strong><br /></span><span><strong>dtxinnovations@gmail.com</strong><br /></span></p>\n<p>The post <a href=\"https://chainwire.org/2025/02/25/dtx-exchange-sets-final-token-price-at-0-36-as-presale-concludes/\">DTX Exchange Sets Final Token Price at $0.36 as Presale Concludes</a> appeared first on <a href=\"https://chainwire.org\">Chainwire</a>.</p>\n"
  },
  {
    "title": "Byzantine Finance Raises $3M to Build Institutional Restaking Gateway",
    "link": "https://chainwire.org/2025/02/25/byzantine-finance-raises-3m-to-build-institutional-restaking-gateway/",
    "pubDate": "2025-02-25T10:54:12.000Z",
    "content": "<p><strong>Paris, France, February 25th, 2025, Chainwire</strong></p>\n<p>&nbsp;</p>\n<p><a href=\"https://www.byzantine.fi/\" target=\"_blank\" rel=\"nofollow noopener\">Restaking aggregation</a> layer Byzantine Finance has announced that it has completed a $3M pre-seed round led by Node Capital and Blockwall Ventures. The funding will help Byzantine deliver institutional access to restaking through a seamless aggregation layer.</p>\n<p>Restaking is the internet bond market. Invested assets are not used to secure only one system but multiple, spreading risk between them and earning returns from all of them. With base staking returns decreasing due to high demand, restaking increases attainable yield without materially increasing surface risk. Byzantine’s restaking solution gives institutions and professional investors exposure to one of the most lucrative new DeFi primitives, with a TVL of over $20B.</p>\n<p>Byzantine’s pre-seed round attracted broad interest from web3-focused VCs and angel investors. More than 30 investors participated in the round, with Node Capital and Blockwall Ventures joined by Lightshift, Masterkey VC, and Kiln Ventures, as well as angels from EigenLayer, LayerZero, P2P, Staking Rewards, Ledger, BitGo, Drosera, Request Finance, and more.</p>\n<p>Byzantine’s protocol is the first permissionless restaking aggregation layer and features institutional-grade security and protocol architecture. It enables anyone to permissionlessly deploy bespoke restaking strategies via intelligent onchain vaults. Through combining different networks, restaking protocols, operators, and collateral assets, creators can deploy fully customized restaking products in the form of distinct onchain vaults, mitigating risk by keeping funds completely isolated.</p>\n<p>Byzantine Finance Co-Founder and CEO Gaia Ferrero Regis said: “We’re grateful to our investors for sharing our belief in the need for a restaking protocol catered to the needs of professional clients. As we began to research the foundations of Byzantine, we spoke with hundreds of institutional web3 players, and were surprised to hear how many of them were blocked from participating in restaking. Byzantine fixes that. We allow institutions to build secure, segregated restaking portfolios for their operational and risk needs, helping them maximize returns and turning restaking into an institutional-grade onchain primitive.”</p>\n<p>Alan Curtis, COO of Eigen Labs, added: “Byzantine Finance is setting a new standard for restaking infrastructure. Their commitment to advancing restaking aligns perfectly with EigenLayer&#8217;s mission and will play a key role in expanding access to restaking opportunities for institutional users.”</p>\n<p>Restaking is currently fragmented across numerous networks including Ethereum and Layer 2s, but also Solana, BTC, and others. As a result, opportunities to participate in restaking and to earn multiple sources of yield, including ETH staking rewards, are limited. Byzantine simplifies access to restaking through an open-source protocol that enables financial managers to create sophisticated restaking strategies without increasing complexity for end-users. Byzantine also distributes points to incentivize early protocol users who meet specific criteria.</p>\n<p><strong>About Byzantine Finance</strong></p>\n<p>Byzantine is the decentralized protocol making restaking accessible to all. Designed to make restaking strategies permissionless and flexible, Byzantine supports more competitive, risk-optimized yield. As the first restaking aggregation layer, Byzantine empowers onchain users, including institutions, to do more with their assets.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<h5>Contact</h5>\n<p><strong>Itai Elizur</strong><br />\n<strong>itai@marketacross.com</strong></p>\n<p>The post <a href=\"https://chainwire.org/2025/02/25/byzantine-finance-raises-3m-to-build-institutional-restaking-gateway/\">Byzantine Finance Raises $3M to Build Institutional Restaking Gateway</a> appeared first on <a href=\"https://chainwire.org\">Chainwire</a>.</p>\n"
  },
  {
    "title": "Bitget Introduces Isolated Spot Margin Trading for STETH/USDT",
    "link": "https://chainwire.org/2025/02/25/bitget-introduces-isolated-spot-margin-trading-for-steth-usdt/",
    "pubDate": "2025-02-25T08:00:49.000Z",
    "content": "<p><span><strong>Victoria, Seychelles, February 25th, 2025, Chainwire</strong></span></p>\n<p></p>\n<p><a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://www.bitget.com/\">Bitget</a>, a leading cryptocurrency exchange, and Web3 company, has officially launched isolated spot margin trading for the STETH/USDT trading pair. This expansion enhances trading opportunities by providing users with greater flexibility and cost-effective leverage options.</p>\n<p>To mark the listing of new trading pairs, Bitget will distribute spot leverage cut-rate coupons and trading bonuses to eligible users. These incentives, credited randomly to users’ accounts, can be utilized to access leverage at reduced or zero interest rates. Additionally, the trading bonuses can be directly applied to margin trading. Users can claim these rewards through the Coupons Center on the Bitget platform.</p>\n<p>Bitget remains committed to enhancing its trading ecosystem by offering innovative financial tools that cater to both novice and experienced traders. The introduction of isolated spot margin trading for STETH/USDT aligns with the platform’s goal of broadening access to diversified trading strategies while ensuring cost efficiency.</p>\n<p>For more information on spot margin trading for STETH/USDT, visit <a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://www.bitget.com/support/articles/12560603823177\">here</a><a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://www.bitget.com/support/articles/12560603823151\">.</a></p>\n<p><strong>About Bitget</strong></p>\n<p>Established in 2018, <a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://www.bitget.com/\">Bitget</a> is the world&#8217;s leading <a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://www.bitget.com/\">cryptocurrency exchange</a> and Web3 company. Serving over 100 million users in 150+ countries and regions, the Bitget exchange is committed to helping users trade smarter with its pioneering copy trading feature and other trading solutions while offering real-time access to <a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://www.bitget.com/price/bitcoin\">Bitcoin price</a>,<a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://www.bitget.com/price/ethereum\"> Ethereum price</a>, and other cryptocurrency prices. Formerly known as BitKeep, <a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://web3.bitget.com/en\">Bitget Wallet</a> is a world-class multi-chain crypto wallet that offers an array of comprehensive Web3 solutions and features including wallet functionality, token swap, NFT Marketplace, DApp browser, and more.</p>\n<p>Bitget is at the forefront of driving crypto adoption through strategic partnerships, such as its role as the Official Crypto Partner of the World&#8217;s Top Football League, <strong>LALIGA</strong>, in EASTERN, SEA, and LATAM markets, as well as a global partner of Turkish National athletes <strong>Buse Tosun Çavuşoğlu </strong>(Wrestling world champion), <strong>Samet Gümüş</strong> (Boxing gold medalist) and<strong> İlkin Aydın</strong> (Volleyball national team), to inspire the global community to embrace the future of cryptocurrency.</p>\n<p>For more information, visit: <a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://www.bitget.com/en/\">Website</a> | <a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://twitter.com/bitgetglobal\">Twitter</a> | <a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://t.me/BitgetENOfficial\">Telegram</a> | <a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://www.linkedin.com/company/bitget-global/\">LinkedIn</a> | <a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://discord.com/invite/bitget\">Discord</a> | <a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://web3.bitget.com/en\">Bitget Wallet</a></p>\n<p>For media inquiries, please contact: media@bitget.com</p>\n<p><strong>Risk Warning: </strong>Digital asset prices are subject to fluctuation and may experience significant volatility. Investors are advised to only allocate funds they can afford to lose. The value of any investment may be impacted, and there is a possibility that financial objectives may not be met, nor the principal investment recovered. Independent financial advice should always be sought, and personal financial experience and standing carefully considered. Past performance is not a reliable indicator of future results. Bitget accepts no liability for any potential losses incurred. Nothing contained herein should be construed as financial advice. For further information, please refer to our <a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://www.bitget.com/support/articles/360014944032-terms-of-use\">Terms of Use</a>.</p>\n<p></p>\n<h5>Contact</h5>\n<p><span><strong>Media</strong><br /></span><span><strong>Public Relations</strong><br /></span><span><strong>Bitget</strong><br /></span><span><strong>media@bitget.com</strong><br /></span></p>\n<p>The post <a href=\"https://chainwire.org/2025/02/25/bitget-introduces-isolated-spot-margin-trading-for-steth-usdt/\">Bitget Introduces Isolated Spot Margin Trading for STETH/USDT</a> appeared first on <a href=\"https://chainwire.org\">Chainwire</a>.</p>\n"
  },
  {
    "title": "Consensus concludes sold-out debut event in Hong Kong and announces return to Asia in 2026",
    "link": "https://chainwire.org/2025/02/25/consensus-concludes-sold-out-debut-event-in-hong-kong-and-announces-return-to-asia-in-2026/",
    "pubDate": "2025-02-25T06:14:01.000Z",
    "content": "<p><span><strong></strong></span></p>\n<p></p>\n<ul>\n<li>The Hong Kong Convention and Exhibition Centre reached maximum capacity, with nearly 10,000 in-person attendees from over 100 countries, solidifying the conference&#8217;s position as a marquee event of the region.</li>\n<li>The conference, and its 350+ side events held over the week, are estimated to have contributed HK$275m to the economy.</li>\n<li>Sold-out event highlights the conference&#8217;s success in bridging East-meets-West dialogue, with industry-altering announcements made throughout the week.</li>\n</ul>\n<p>HONG KONG, Feb. 25, 2025 /PRNewswire/ &#8211; Consensus Hong Kong, which took place between February 18 and 20, 2025, has officially wrapped up its sold-out debut. As the world&#8217;s biggest and longest-serving event series for critical conversations on Web3, digital assets, and blockchain, Consensus attracted nearly 10,000 in-person attendees, from 102 countries to Hong Kong, with a combined AUM for attendees estimated at more than US$4 trillion. The success of the event has garnered international attention, so much so that it has officially announced today that it will be returning to Asia again next year in 2026.</p>\n<p>The event&#8217;s arrival in Hong Kong coincided with several key regional milestones, with notable announcements during the week taking place, including:</p>\n<ul>\n<li>Hong Kong&#8217;s financial regulator, the <a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://apps.sfc.hk/edistributionWeb/gateway/EN/news-and-announcements/news/doc?refNo=25PR20\">Securities and Futures Commission</a> (SFC), unveiled a new road map with 12 initiatives designed to &#8220;future-proof&#8221; Hong Kong&#8217;s virtual asset ecosystem;</li>\n<li><a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://www.sc.com/en/press-release/standard-chartered-animoca-brands-and-hkt-establish-joint-venture-to-issue-hkd-backed-stablecoin/\">Standard Chartered</a> publicized its joint venture with Animoca Brands and Hong Kong Telecom (HKT) to seek a licence from the Hong Kong Monetary Authority (HKMA) to issue a Hong Kong dollar-backed stablecoin.</li>\n<li>Other announcements came from Hex Trust, Robinhood, WisdomTree, Pundi AI, zkMe, and more.</li>\n<li><a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://www.sfc.hk/en/Welcome-to-the-Fintech-Contact-Point/Virtual-assets/Virtual-asset-trading-platforms-operators/Lists-of-virtual-asset-trading-platforms\">Bullish Group</a>, the parent company of CoinDesk, announced that its Hong Kong digital asset trading business has received licensing approval from the SFC;</li>\n</ul>\n<p>Seventy-five percent of the nearly 10,000 in-person attendees traveled from overseas, driving up tourism in Hong Kong and bringing in an estimated HK$275m to the city. Over 450 media registered to report on the event and hear from over 300 high-caliber speakers from the Hong Kong government, Web3 regulators, and brands like Binance, Blockstream, Circle, Coinbase, Google, Pantera, Robinhood, and Solana Foundation. Supported by over 125 sponsors and over 160 community partners, including Auros, Hex Trust, TRON, Aptos, CoinW, Dimitra, First Digital, Genius, Zeebu, and many more, the team was able to fulfill its mission of making Consensus the most important platform for digital assets and Web3.</p>\n<p>In addition to the main conference line-up, over 350 side events took place over the course of the week in iconic Hong Kong venues. Cloud 39 at the Henderson, The Hong Kong Jockey Club, Wonderland (West Kowloon Cultural District) the Grand Hyatt, and Iron Fairies hosted special events, such as the opening Rooftop Revelry, Consensus Cup, Token of Love music festival, Crypto Fight Night and the Closing Party. Additional community-hosted side events took place in venues across the city including at Trilogy, Soho House, Popinjays, The Kerry Hotel, Luk Yu Tea House, Faye, K11, Dragon-I, Ozone, Cardinal Point, and dozens of others.</p>\n<p>Its signature experiences, including the Hackathon and PitchFest, drew tech talent from all over the world:</p>\n<ul>\n<li>Over 500 top developers &#8211; including from Thiel Fellows, and quants from top investment banks JP Morgan and Morgan Stanley &#8211; joined the two-day, in-person Hackathon run in partnership with EasyA. In total, 67 ground-breaking blockchain projects were launched to compete for more than US$400K in prizes and grants. There were six tracks at the Hackathon: Aptos, Ripple, MozaicNFT, Crust, Original Trail, and Polkadot, which were won respectively by ProfitX, Xeno, MozaicDot, MoME (Mixture of Multi-chain Experts) and Pix x Origintrail Telegram Bot.</li>\n<li>Over 400 of the world&#8217;s most promising early-stage Web3 start-ups attended, with 12 competing live onstage at CoinDesk PitchFest for investor attention. TransCrypts, a leader in digital identity and credentials, backed by Mark Cuban, GSR Ventures, and others emerged as the winner. The competition was judged by top investors from Spartan Ventures, Titan Fund, CMCC, Foresight Ventures, Animoca Brands, and more.</li>\n</ul>\n<blockquote><p><strong>Michael Lau, Chairman of Consensus Hong Kong, said, </strong>&#8220;Consensus Hong Kong was an overwhelming success. The combination of our nearly 10,000 in-person attendees and over 350 side events is independent validation proving our conference achieved incredible product-market fit. It is clear that the global Web3 industry has been asking for a truly world-class conference in Hong Kong for a while, and Consensus Hong Kong was the answer. Hong Kong has worked hard to strategically position itself as a forward-thinking digital assets hub with a vibrant ecosystem that fosters entrepreneurial spirits, so we hope to return again next year—at an even bigger scale.&#8221;</p></blockquote>\n<blockquote><p><strong>Brad Spies, Managing Director of Consensus said, </strong>&#8220;Consensus has always had a laser focus on bringing together all of the different parts of the crypto ecosystem: traditional finance, DeFi traders, regulators, developers, entrepreneurs, investors, startups, academics, and artists. We are humbled to host heavyweight attendees from around the world looking to connect, and share singular experiences from day to night. Consensus Hong Kong has taken that mission to a new level, bringing together all sides of the industry, east and west, and using Hong Kong&#8217;s unparalleled venues, restaurants, and community as a way to bring people together to share ideas, create business opportunities, and have an excellent time doing it.&#8221;</p></blockquote>\n<p><strong>Media contact:</strong></p>\n<p>Cognito on behalf of Consensus Hong Kong</p>\n<p><a target=\"_blank\" rel=\"nofollow noopener\" href=\"mailto:ConsensusHK@cognitomedia.com\">ConsensusHK@cognitomedia.com</a> </p>\n<p><strong>About Consensus</strong></p>\n<p>Since 2015, Consensus has been the world&#8217;s largest and most influential gathering of digital assets, blockchain, and Web3 communities. Consensus now heads to Hong Kong, bringing together the industry&#8217;s most important voices from East and West for pivotal conversations and deal-making opportunities.</p>\n<p>Consensus Hong Kong convenes global leaders in tech and finance to debate pressing issues, announce key developments and deals, and share their visions for the future. Consensus is produced by the award-winning media outlet CoinDesk and is guided by its commitment to independent, unbiased journalism. Consensus sets the agenda for the next wave of innovation and deal-making in the crypto and Web3 space.</p>\n<p><strong>About CoinDesk</strong></p>\n<p><a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=4108961-1&amp;h=803920704&amp;u=https%3A%2F%2Fwww.coindesk.com%2F&amp;a=%C2%A0CoinDesk\"><strong>CoinDesk</strong></a> is the most trusted media, events, indices, and data company for the global crypto economy. Since 2013, CoinDesk Media has led the story of the future of money and investing, illuminating the transformation in society and culture that comes with it. Our award-winning team of journalists delivers news and unparalleled insights that bring transparency, comprehension, and context. CoinDesk Events gathers the global crypto, blockchain, and Web3 communities at annual events such as Consensus, the world&#8217;s largest and longest-running crypto festival. CoinDesk Indices offers expertise in digital asset indices, data, and research to educate and empower investors. In November 2023, <a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=4108961-1&amp;h=14615577&amp;u=https%3A%2F%2Fbullish.com%2Fnews-insights%2Fnews%2Fbullish-acquires-coindesk-from-digital-currency-group%2F&amp;a=CoinDesk+was+acquired\"><strong>CoinDesk was acquired</strong></a> by Bullish Group. CoinDesk operates as an independent subsidiary and abides by a <a target=\"_blank\" rel=\"nofollow noopener\" href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=4108961-1&amp;h=112304520&amp;u=https%3A%2F%2Fwww.coindesk.com%2Fethics%2F&amp;a=strict+set+of+editorial+policies\"><strong>strict set of editorial policies</strong></a>. For more information on CoinDesk media and events, please visit CoinDesk.com. For breaking headlines, data, and indices, visit CoinDeskmarkets.com.</p>\n<p>The post <a href=\"https://chainwire.org/2025/02/25/consensus-concludes-sold-out-debut-event-in-hong-kong-and-announces-return-to-asia-in-2026/\">Consensus concludes sold-out debut event in Hong Kong and announces return to Asia in 2026</a> appeared first on <a href=\"https://chainwire.org\">Chainwire</a>.</p>\n"
  }
]