[
  {
    "title": "Bitget Introduces IP On-chain Earn Offering Up to 35% APR",
    "link": "https://chainwire.org/2025/03/10/bitget-introduces-ip-on-chain-earn-offering-up-to-35-apr/",
    "pubDate": "Mon, 10 Mar 2025 12:00:29 +0000",
    "content": "Victoria, Seychelles, March 10th, 2025, Chainwire Bitget, the leading cryptocurrency exchange and Web3 company, has announced its latest investment product, IP On-chain Earn, offering an attractive annual percentage rate (APR) of 25% to 35%. This new opportunity allows users to optimize their earnings through seamless participation in blockchain-based financial products. IP On-chain Earn is now available on the Bitget platform, enabling users to subscribe and start accruing interest with ease. Interest calculations begin at 12:00 AM (UTC+8) on the day following subscription (D+1). If a subscription occurs after 12:00 AM (UTC+8), interest accrual commences on the second day (D+2). Users can redeem their funds anytime using Express Redemption or Standard Redemption features. Bitget remains committed to delivering innovative and rewarding financial solutions within the digital asset ecosystem. By offering competitive returns through IP On-chain Earn, Bitget continues to expand its suite of earning products to meet the growing demand for passive income opportunities in the cryptocurrency sector. For more information on subscription details and interest calculations, users can visit the official Bitget platform and refer to the comprehensive guide on passive profit strategies. For more information on IP On-chain Earn With 25, visit here. About Bitget Established in 2018, Bitget is the world&#8217;s leading cryptocurrency exchange and Web3 company. Serving over 100 million users in 150+ countries and regions, the Bitget exchange is committed to helping users trade smarter with its pioneering copy trading feature and other trading solutions, while offering real-time access to Bitcoin price, Ethereum price, and other cryptocurrency prices. Formerly known as BitKeep, Bitget Wallet is a world-class multi-chain crypto wallet that offers an array of comprehensive Web3 solutions and features including wallet functionality, token swap, NFT Marketplace, DApp browser, and more. Bitget is at the forefront of driving crypto adoption through strategic partnerships, such as its role as the Official Crypto Partner of the World&#8217;s Top Football League, LALIGA, in EASTERN, SEA and LATAM markets, as well as a global partner of Turkish National athletes Buse Tosun Çavuşoğlu (Wrestling world champion), Samet Gümüş (Boxing gold medalist) and İlkin Aydın (Volleyball national team), to inspire the global community to embrace the future of cryptocurrency. For more information, visit: Website | Twitter | Telegram | LinkedIn | Discord | Bitget Wallet For media inquiries, please contact: media@bitget.com Risk Warning: Digital asset prices are subject to fluctuation and may experience significant volatility. Investors are advised to only allocate funds they can afford to lose. The value of any investment may be impacted, and there is a possibility that financial objectives may not be met, nor the principal investment recovered. Independent financial advice should always be sought, and personal financial experience and standing carefully considered. Past performance is not a reliable indicator of future results. Bitget accepts no liability for any potential losses incurred. Nothing contained herein should be construed as financial advice. For further information, please refer to our Terms of Use."
  },
  {
    "title": "Bitget Launches AUDIOUSDT Futures Trading with Up to 25x Leverage",
    "link": "https://chainwire.org/2025/03/10/bitget-launches-audiousdt-futures-trading-with-up-to-25x-leverage/",
    "pubDate": "Mon, 10 Mar 2025 11:10:38 +0000",
    "content": "Victoria, Seychelles, March 10th, 2025, Chainwire Bitget, the leading cryptocurrency exchange and Web3 company, has announced AUDIOUSDT for futures trading, offering traders a maximum leverage of 25x. Additionally, futures trading bots are now supported for AUDIOUSDT, enhancing automated trading capabilities. The new listing became available on March 10, 2025 (UTC+8). Traders can access AUDIOUSDT-M perpetual futures via Bitget’s official website (www.bitget.com) or the Bitget app. This listing provides expanded opportunities for users seeking diversified trading strategies. AUDIOUSDT-M perpetual futures use AUDIO as the underlying asset and USDT as the settlement asset. The tick size for this contract is set at 0.00001, and traders can utilize a maximum leverage of 25x. Funding fees are settled every eight hours, and trading is available 24/7. Bitget continuously evaluates market risk conditions and may adjust parameters such as tick size, maximum leverage, and maintenance margin rates as necessary. Bitget’s futures offerings include USDT-M Futures, Coin-M Futures, and USDC-M Futures. USDT-M Futures allow traders to use USDT as margin for all trading pairs, enabling them to manage multiple currency positions within a shared account equity framework. For more information on AUDIOUSDT, visit here. About Bitget Established in 2018, Bitget is the world&#8217;s leading cryptocurrency exchange and Web3 company. Serving over 100 million users in 150+ countries and regions, the Bitget exchange is committed to helping users trade smarter with its pioneering copy trading feature and other trading solutions, while offering real-time access to Bitcoin price, Ethereum price, and other cryptocurrency prices. Formerly known as BitKeep, Bitget Wallet is a world-class multi-chain crypto wallet that offers an array of comprehensive Web3 solutions and features including wallet functionality, token swap, NFT Marketplace, DApp browser, and more. Bitget is at the forefront of driving crypto adoption through strategic partnerships, such as its role as the Official Crypto Partner of the World&#8217;s Top Football League, LALIGA, in EASTERN, SEA and LATAM markets, as well as a global partner of Turkish National athletes Buse Tosun Çavuşoğlu (Wrestling world champion), Samet Gümüş (Boxing gold medalist) and İlkin Aydın (Volleyball national team), to inspire the global community to embrace the future of cryptocurrency. For more information, visit: Website | Twitter | Telegram | LinkedIn | Discord | Bitget Wallet For media inquiries, please contact: media@bitget.com Risk Warning: Digital asset prices are subject to fluctuation and may experience significant volatility. Investors are advised to only allocate funds they can afford to lose. The value of any investment may be impacted, and there is a possibility that financial objectives may not be met, nor the principal investment recovered. Independent financial advice should always be sought, and personal financial experience and standing carefully considered. Past performance is not a reliable indicator of future results. Bitget accepts no liability for any potential losses incurred. Nothing contained herein should be construed as financial advice. For further information, please refer to our Terms of Use."
  },
  {
    "title": "Bitget Lists Bubblemaps (BMT) Adding it to Spot Trading",
    "link": "https://chainwire.org/2025/03/10/bitget-lists-bubblemaps-bmt-adding-it-to-spot-trading/",
    "pubDate": "Mon, 10 Mar 2025 10:53:31 +0000",
    "content": "Victoria, Seychelles, March 10th, 2025, Chainwire Bitget, the leading cryptocurrency exchange and Web3 company, has announced the listing of Bubblemaps (BMT), an on-chain data visualization platform. Trading for BMT/USDT will commence on 11 March 2025, 12:00 (UTC). Bubblemaps is a crypto analytics tool that turns blockchain data into a powerful, visually interactive experience, which aligns with a growing demand for accessible blockchain data. Bubblemaps transforms blockchain data into a visual experience, making analysis both engaging and efficient. With unique and colorful bubbles, it makes on-chain data easy to understand, helping users to investigate wallets, reveal connections, and see through the noise of blockchain data. Its advanced tools simplify tokenomics, enabling users to uncover coins with deceptive supply. The listing of Bubblemaps provides an opportunity for users to engage with an innovative investment data tool. It expands Bitget&#8217;s portfolio of assets available in the Innovation and Web3 Zone, underlining the platform&#8217;s commitment to offering promising projects which aligns with user needs and decentralized principles of blockchain technology. Bitget has consistently expanded its market share in both spot and derivatives trading among centralized exchanges. With an extensive selection of over 900 cryptocurrency pairs and a commitment to broaden its offerings to more than 900 trading pairs, Bitget connects users to various ecosystems, including Bitcoin, Ethereum, Solana, Base, and TON. For more information on Bubblemaps (BMT), users can visit here. About Bitget Established in 2018, Bitget is the world&#8217;s leading cryptocurrency exchange and Web3 company. Serving over 100 million users in 150+ countries and regions, the Bitget exchange is committed to helping users trade smarter with its pioneering copy trading feature and other trading solutions, while offering real-time access to Bitcoin price, Ethereum price, and other cryptocurrency prices. Formerly known as BitKeep, Bitget Wallet is a world-class multi-chain crypto wallet that offers an array of comprehensive Web3 solutions and features including wallet functionality, token swap, NFT Marketplace, DApp browser, and more. Bitget is at the forefront of driving crypto adoption through strategic partnerships, such as its role as the Official Crypto Partner of the World&#8217;s Top Football League, LALIGA, in EASTERN, SEA and LATAM markets, as well as a global partner of Turkish National athletes Buse Tosun Çavuşoğlu (Wrestling world champion), Samet Gümüş (Boxing gold medalist) and İlkin Aydın (Volleyball national team), to inspire the global community to embrace the future of cryptocurrency. For more information, visit: Website | Twitter | Telegram | LinkedIn | Discord | Bitget Wallet For media inquiries, please contact: media@bitget.com Risk Warning: Digital asset prices are subject to fluctuation and may experience significant volatility. Investors are advised to only allocate funds they can afford to lose. The value of any investment may be impacted, and there is a possibility that financial objectives may not be met, nor the principal investment recovered. Independent financial advice should always be sought, and personal financial experience and standing carefully considered. Past performance is not a reliable indicator of future results. Bitget accepts no liability for any potential losses incurred. Nothing contained herein should be construed as financial advice. For further information, please refer to our Terms of Use."
  },
  {
    "title": "Foresight Ventures participates in $10M Series A Investment Round of August",
    "link": "https://chainwire.org/2025/03/10/foresight-ventures-participates-in-10m-series-a-investment-round-of-august/",
    "pubDate": "Mon, 10 Mar 2025 09:00:11 +0000",
    "content": "Singapore, Singapore, March 10th, 2025, Chainwire Foresight Ventures, a leading crypto VC firm, announces participation in a $10 million Series A funding round of August, an on-chain prime brokerage and execution platform. The round was led by Dragonfly Ventures with participation from fellow notable venture capitals &#8211; 6th Man Ventures (6MV), FinTech Collective, Robot Ventures, Maven11, SCB Limited, and others. This investment accelerates August’s on-chain prime brokerage capabilities, with a portfolio margin system enabling institutions to use staked assets and yield-bearing positions as collateral for structured products, OTC derivatives, and credit. With seamless cross-margining and enhanced capital efficiency, clients can hedge DeFi portfolios with CeFi rails—all within a single on-chain account. August supports 12+ blockchains, 250+ tokens, and 70 protocols, unlocking liquidity across any liquid asset. In a world where more assets are getting tokenized, and continue to move on-chain, August provides the most capital-efficient infrastructure for trade execution, maximizing liquidity and capital optimization. August facilitates over $7 billion in monthly transaction volume across lending, DeFi, and OTC transactions, and algorithmic swaps with $400M+ in loans originated across lending, DeFi, and OTC transactions, and algorithmic swaps. The company rebranded to underscore its commitment to building trusted financial infrastructure for a crypto industry recovering after the collapse of centralized finance (CeFi). August provides institutions, protocols, and trading desks with a comprehensive suite of on-chain financial tools, including Smart contract multi-signature accounts, Trade execution, Borrowing and lending, Options and structured products, Tri-party collateral management, Cross-margining, and structured DeFi strategies. Clients supported today include both institutional hedge funds and principal trading firms, as well as protocols such as Upshift, the first decentralized application built on August, with a total value locked (TVL) of around $300M. &#8220;The events of 2022 following the collapse of large centralized finance counterparties, more liquidity and volume has moved on-chain over the past two years, demonstrating that transparency and risk management are non-negotiable,&#8221; said Aya Kantorovich, Co-Founder and Co-CEO of August. &#8220;August is setting a new standard for capital-efficient and institutionally viable digital asset trading, where trust is no longer assumed—it&#8217;s built into the infrastructure itself.&#8221;, said Alexandre Elkrief, Co-Founder and Co-CEO of August. Forest Bai, co-founder of Foresight Ventures, noted “August is restoring the trust the market lost in DeFi lending and OTC transactions following some previous black swan incidents. Supporting the August team aligns with Foresight Ventures&#8217; longer-term vision to help bring usable crypto products to retail and institutional investors. He added “The potential of the intersection of TradFi capital optimization, DeFi, OTC, and algorithmic swaps in particular, is promising, and we believe the August team has the right zeal to capture more market share. With the United States at the forefront, global sentiment is increasingly favorable towards crypto, presenting a market opportunity that August can leverage with the new funding.” By bringing on-chain verifiability to these services, August eliminates the hidden risks that have plagued CeFi. With August, credit and counterparty risk can be monitored and mitigated in real time. &#8220;FTX and 3AC didn&#8217;t fail due to a lack of institutional interest in digital assets,&#8221; said Rob Hadick, General Partner at Dragonfly Capital. &#8220;They failed because risk was obfuscated, and counterparty exposure was unmanageable. August provides real-time risk measurement, programmatic collateral management, and default transparency.&#8221; “We are thrilled to double down on August, the leader in On-chain Capital Markets. August combines the speed and composability of DeFi with the risk management tools required by the world&#8217;s largest institutions. Now these benefits will be available to the public via Upshift. The future of finance is now,” adds Carl Vogel, General Partner at 6th Man Ventures. About Foresight Ventures Foresight Ventures is the first and only crypto VC bridging East and West. With a research-driven approach and offices in the US and Singapore, they are a powerhouse in crypto investment and incubation. Their premier media network includes The Block, Foresight News, BlockTempo, and Coinness. They invest in the most daring innovations. They are dedicated to partnering with visionary projects and top teams to help them succeed, reshaping the future of digital finance and beyond. For more information, users can visit: Website | Twitter | LinkedIn For media requests, users can contact media@foresightventures.com. About August August, an on-chain prime brokerage and execution platform that enables users to borrow, lend, trade, and clear across any DeFi and CeFi application with any form of liquid collateral. August supports all DeFi primitives, including lending, borrowing, spot execution, over-the-counter options, and derivatives."
  },
  {
    "title": "Market Needs a Stronger Boost than Trump’s Crypto Strategic Reserve: New Bybit x Block Scholes Crypto Derivatives Report",
    "link": "https://chainwire.org/2025/03/10/market-needs-a-stronger-boost-than-trumps-crypto-strategic-reserve-new-bybit-x-block-scholes-crypto-derivatives-report/",
    "pubDate": "Mon, 10 Mar 2025 08:40:56 +0000",
    "content": "DUBAI, UAE, March 10, 2025 /PRNewswire/ &#8212; Bybit, the world&#8217;s second-largest cryptocurrency exchange by trading volume, released the latest weekly crypto derivatives analytics report with Block Scholes as President Trump signed the executive order to establish a strategic BTC reserve on Thursday. In the first week of March, crypto market movements suggested traders had digested the positive news and pulled towards bearish territories with a declining S&P 500 and growing skepticism surrounding ETH and SOL. This waning enthusiasm is evidenced by a notable increase in demand for short-term protective options as investors seek to mitigate potential risks in the evolving market landscape. Key Highlights: Stable Funding Rates: Following President Trump&#8217;s announcement on Mar. 2, the spot prices of involved cryptocurrencies surged. However, funding rates for these assets have not reached extreme levels, remaining relatively stable compared to highs seen prior to Trump&#8217;s inauguration. This suggests a balanced demand for long positions, indicating subdued short interest in the market. Volatility in ETH Options: The enthusiasm surrounding ETH was quickly tempered as ongoing tariff discussions contributed to bearish market sentiment. This has resulted in a notable increase in realized volatility, surpassing options-implied levels. As traders seek protection, the market has seen a shift in short-term volatility towards puts, reflecting a cautious outlook. Decline in SOL Open Interest: The report also notes a decrease in open interest for Solana options at the end of February. Despite the inclusion of SOL in the proposed crypto reserve, open interest has not seen a corresponding uptick, with a majority of new positions still favoring calls, albeit at a lackluster pace. Access the Full Report For detailed insights, readers may download the full report. #Bybit / #TheCryptoArk /#BybitResearch About Bybit Bybit is the world&#8217;s second-largest cryptocurrency exchange by trading volume, serving a global community of over 60 million users. Founded in 2018, Bybit is redefining openness in the decentralized world by creating a simpler, open and equal ecosystem for everyone. With a strong focus on Web3, Bybit partners strategically with leading blockchain protocols to provide robust infrastructure and drive on-chain innovation. Renowned for its secure custody, diverse marketplaces, intuitive user experience, and advanced blockchain tools, Bybit bridges the gap between TradFi and DeFi, empowering builders, creators, and enthusiasts to unlock the full potential of Web3. Discover the future of decentralized finance at Bybit.com. For more details about Bybit, please visit Bybit Press For media inquiries, please contact: media@bybit.com For updates, please follow: Bybit&#8217;s Communities and Social Media Discord | Facebook | Instagram | LinkedIn | Reddit | Telegram | TikTok | X | Youtube"
  }
]